/*  Завдання 2
    Створіть об'єкт book з такими властивостями:
    title: рядок, представляє назву книги.
    author: рядок, представляє автора книги.
    year: число, представляє рік видання книги.

    Деструктуризуйте назву та автора книги з об'єкта book.
    Виведіть деструктуризовані змінні в консоль.
 */

const book = {
    title: 'Jungle book',
    author: 'Rudyard Kipling',
    year: 1984
    }

// Деструктуризация - способ получить свойства объекта и присвоить их переменным
const {title, author} = book;

console.log(`Название книги: ${title}`);
console.log(`Автор книги: ${author}`);






